src/cf/Catalogs/ЕдиницыИзмеренияВЕТИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЕдиницыИзмеренияВЕТИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторВерсии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВерсионныхОбъектовВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмеренияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяЗагрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЕдиницаИзмерения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ЕдиницыИзмеренияВЕТИС/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Ссылка");
	Поля.Добавить("Наименование");
	Поля.Добавить("ТребуетсяЗагрузка");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.ТребуетсяЗагрузка = Истина Тогда
		СтандартнаяОбработка = Ложь;
		Представление = НСтр("ru = '<не загружено>'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//Возвращает коэффициент пересчета единицы измерения ВЕТИС относительно базовой единицы измерения.
//
//Параметры:
//   БазоваяЕдиницаИзмерения - СправочникСсылка.ЕдиницыИзмеренияВЕТИС - Базовая единица измерения ВЕТИС.
//   ЕдиницаИзмерения        - СправочникСсылка.ЕдиницыИзмеренияВЕТИС - Единица измерения ВЕТИС, для которой 
//                                                                      рассчитывается коэффициент пересчета.
//
//Возвращаемое значение:
//   Число - коэффициент пересчета единицы измерения ВЕТИС относительно базовой единицы измерения.
//
Функция КоэффициентПересчета(БазоваяЕдиницаИзмерения, ЕдиницаИзмерения) Экспорт
	
	Если Не ЗначениеЗаполнено(БазоваяЕдиницаИзмерения)
		Или Не ЗначениеЗаполнено(ЕдиницаИзмерения)
		Или БазоваяЕдиницаИзмерения = ЕдиницаИзмерения Тогда
		
		Коэффициент = 1;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ВЫРАЗИТЬ(&ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмеренияВЕТИС).Коэффициент, 1)
		|		/ ЕСТЬNULL(ВЫРАЗИТЬ(&БазоваяЕдиницаИзмерения КАК Справочник.ЕдиницыИзмеренияВЕТИС).Коэффициент, 1) КАК Коэффициент";
		
		Запрос.УстановитьПараметр("БазоваяЕдиницаИзмерения", БазоваяЕдиницаИзмерения);
		Запрос.УстановитьПараметр("ЕдиницаИзмерения",        ЕдиницаИзмерения);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		Коэффициент = Выборка.Коэффициент;
		
	КонецЕсли;
	
	Возврат Коэффициент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
